src/cf/Documents/ЭлектронныйЗаказЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЭлектронныйЗаказЗаявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТитулГрузоотправителяФункция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулГрузоотправителяЗаказНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулГрузоотправителяЗаказДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулГрузоотправителяГрузоотправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулГрузоотправителяСоставитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулГрузоотправителяПеревозчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулГрузоотправителяЗаявленныеДатаВремяПодачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулПеревозчикаПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулПеревозчикаЛицоОтветственноеЗаПеревозку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицоЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулПеревозчикаСоставитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулГрузоотправителяИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулГрузоотправителяДатаФормированияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулГрузоотправителяВремяФормированияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулПеревозчикаИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулПеревозчикаДатаФормированияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулПеревозчикаВремяФормированияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДМинтранс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПолученныйТитул</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовРегламентаЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийТитул</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовРегламентаЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольУчастника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГрузоотправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>46</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>46</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИныеПолучателиСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийШаг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийШагВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументыОснованияЭСВ_ЭПД</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ВерсииТитуловЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииТитуловЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Титул</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовРегламентаЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЗначенияРеквизитовДокументовЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияРеквизитовДокументовЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизитаСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначенияРеквизитовЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизитаСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРеквизита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРеквизитовЭПД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Титул</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовРегламентаЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиРеквизита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыРеквизитовЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРеквизитовЭПД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПростойКромеСтроки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеограниченнаяСтрока</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СсылочныйТип</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ЭлектронныйЗаказЗаявка/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидДокумента) = Ложь Тогда
		ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.ЭЗЗ);
	КонецЕсли;
	
	Если РольУчастника = 0 Тогда 
		РольУчастника = 3;
	КонецЕсли;

	Если РольУчастника = 3 Тогда
		Если ТипЗнч(СсылкаТитулГрузоотправителяГрузоотправитель) = Тип("СправочникСсылка.Организации") Тогда
			Организация = СсылкаТитулГрузоотправителяГрузоотправитель;
		ИначеЕсли ТипЗнч(СсылкаТитулГрузоотправителяСоставитель) = Тип("СправочникСсылка.Организации") Тогда
			Организация = СсылкаТитулГрузоотправителяСоставитель;
		КонецЕсли;
	ИначеЕсли РольУчастника = 1 Тогда
		Если ТипЗнч(СсылкаТитулГрузоотправителяПеревозчик) = Тип("СправочникСсылка.Организации") Тогда
			Организация = СсылкаТитулГрузоотправителяПеревозчик;
		ИначеЕсли ТипЗнч(СсылкаТитулПеревозчикаСоставитель) = Тип("СправочникСсылка.Организации") Тогда
			Организация = СсылкаТитулПеревозчикаСоставитель;
		КонецЕсли;
	КонецЕсли;
	
	ОбменСГИСЭПД.УстановитьТекущийШаг(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Запишем новую версию
	ВерсияТитула = Неопределено;
	Если ДополнительныеСвойства.Свойство("ВерсияТитула", ВерсияТитула) Тогда
		ЗаписьВерсии = РегистрыСведений.ВерсииТитуловЭПД.СоздатьМенеджерЗаписи();
		ЗаписьВерсии.Документ = Ссылка;
		ЗаписьВерсии.Организация = Организация;
		ЗаписьВерсии.Титул = ВерсияТитула.Титул;
		ЗаписьВерсии.НомерВерсии = ВерсияТитула.НомерВерсии;
		
		ЗаписьВерсии.ИдентификаторФайла = ВерсияТитула.ИдентификаторФайла;
		ЗаписьВерсии.ДатаВерсии = ВерсияТитула.ДатаВерсии;
		ЗаписьВерсии.Записать();
	КонецЕсли;
	
	// Запишем реквизиты
	Если ВерсияТитула <> Неопределено Тогда
		СтруктураРеквизитовТитула = Неопределено;
		Если ДополнительныеСвойства.Свойство("СтруктураРеквизитов", СтруктураРеквизитовТитула) Тогда
			НомерВерсии = Неопределено;
			ДополнительныеСвойства.Свойство("НомерВерсии", НомерВерсии);
			Если НомерВерсии = Неопределено Тогда
				НомерВерсии = 0;
			КонецЕсли;
			НаборЗаписейЗначений = РегистрыСведений.ЗначенияРеквизитовДокументовЭПД.СоздатьНаборЗаписей();
			НаборЗаписейЗначений.Отбор.Документ.Установить(Ссылка);
			НаборЗаписейЗначений.Отбор.Титул.Установить(ВерсияТитула.Титул);
			НаборЗаписейЗначений.Отбор.НомерВерсии.Установить(НомерВерсии);
			Для Каждого КиЗ Из СтруктураРеквизитовТитула Цикл
				МассивЧастей = ОбменСГИСЭПДКлиентСервер.РазделитьСтрокуСоСложнымРазделителем(КиЗ.Ключ, "__");
				Если МассивЧастей.Количество() = 3 Тогда
					ИмяТабличнойЧасти = МассивЧастей[0];
					НомерСтрокиРеквизита = Число(МассивЧастей[1]);
					ИмяРеквизита = МассивЧастей[2];
				Иначе
					ИмяТабличнойЧасти = "";
					НомерСтрокиРеквизита = 0;
					ИмяРеквизита = КиЗ.Ключ;
				КонецЕсли;	
				НоваяЗапись = НаборЗаписейЗначений.Добавить();
				НоваяЗапись.Документ = Ссылка;
				НоваяЗапись.Организация = Организация;
				НоваяЗапись.Титул = ВерсияТитула.Титул;
				НоваяЗапись.НомерВерсии = НомерВерсии;
				НоваяЗапись.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
				НоваяЗапись.НомерСтрокиРеквизита = НомерСтрокиРеквизита;
				НоваяЗапись.ИмяРеквизита = ИмяРеквизита;
				Если КиЗ.Значение = Неопределено Или ТипЗнч(КиЗ.Значение) = Тип("Строка") Тогда 
					НоваяЗапись.ЗначениеРеквизитаСтрока = КиЗ.Значение;
					НоваяЗапись.ТипРеквизита = Перечисления.ТипыРеквизитовЭПД.НеограниченнаяСтрока;
				ИначеЕсли ТипЗнч(КиЗ.Значение) = Тип("Число")
					Или ТипЗнч(КиЗ.Значение) = Тип("Дата")
					Или ТипЗнч(КиЗ.Значение) = Тип("Булево") Тогда
						НоваяЗапись.ЗначениеРеквизита = КиЗ.Значение;
						НоваяЗапись.ТипРеквизита = Перечисления.ТипыРеквизитовЭПД.ПростойКромеСтроки;
				Иначе
					НоваяЗапись.ЗначениеРеквизитаСсылка = КиЗ.Значение;
					НоваяЗапись.ТипРеквизита = Перечисления.ТипыРеквизитовЭПД.СсылочныйТип;
				КонецЕсли;
			КонецЦикла;
			НаборЗаписейЗначений.Записать();
		КонецЕсли;
	КонецЕсли;
	
	ИдентификаторОбъектаУчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка));
	
	СтруктураДляРеестра = ОбменСГИСЭПДКлиентСервер.НоваяСтруктураДляРеестраЭПД();
	
	СтруктураДляРеестра.Ссылка = Ссылка;
	Если ЗначениеЗаполнено(СсылкаТитулГрузоотправителяСоставитель) Тогда
		СтруктураДляРеестра.Грузоотправитель = СсылкаТитулГрузоотправителяСоставитель;
	Иначе
		СтруктураДляРеестра.Грузоотправитель = СсылкаТитулГрузоотправителяГрузоотправитель;
	КонецЕсли;
	СтруктураДляРеестра.ДатаДокументаИБ = Дата;
	СтруктураДляРеестра.НомерДокументаИБ = Номер;
	СтруктураДляРеестра.ДатаЭПД = ТитулГрузоотправителяЗаказДата;
	СтруктураДляРеестра.НомерЭПД = ТитулГрузоотправителяЗаказНомер;
	СтруктураДляРеестра.Организация = Организация;
	СтруктураДляРеестра.Перевозчик = СсылкаТитулГрузоотправителяПеревозчик;
	СтруктураДляРеестра.ПометкаУдаления = ПометкаУдаления;
	СтруктураДляРеестра.Проведен = Проведен;	
	СтруктураДляРеестра.Комментарий = Комментарий;
	СтруктураДляРеестра.ТипСсылки = ИдентификаторОбъектаУчета;
	СтруктураДляРеестра.ТекущийШаг = ТекущийШаг;
	СтруктураДляРеестра.ТекущийШагВыполнен = ТекущийШагВыполнен;
	СтруктураДляРеестра.РольУчастника = РольУчастника;
	
	ОбменСГИСЭПД.ЗаписатьВРеестрЭПД(СтруктураДляРеестра);
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбменСГИСЭПДПереопределяемый.ОбработкаЗаполненияЭЗЗ(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ОбъектКопирования.ЭтоВходящий = Истина Тогда
		ВызватьИсключение НСтр("ru='Нельзя копировать входящий документ'");
	КонецЕсли;
	
	ЭтотОбъект.УИДМинтранс = Неопределено;
	ЭтотОбъект.ТитулГрузоотправителяЗаказНомер = Неопределено;
	ЭтотОбъект.ТитулГрузоотправителяЗаказДата = Неопределено;
	
	ПрефиксыТитулов = ОбменСГИСЭПДКлиентСервер.ПрефиксыТитуловДокумента("Документ.ЭлектронныйЗаказЗаявка");
	Для Каждого ПрефиксТитула Из ПрефиксыТитулов Цикл
		ЭтотОбъект[ПрефиксТитула + "ИдентификаторФайла"] = Неопределено;
		ЭтотОбъект[ПрефиксТитула + "ДатаФормированияФайла"] = Неопределено;
		ЭтотОбъект[ПрефиксТитула + "ВремяФормированияФайла"] = Неопределено;
	КонецЦикла;
	ЭтотОбъект.РольУчастника = 3;
	
	ЭтотОбъект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1");
	
КонецПроцедуры

#КонецЕсли
